
//Завершить с помощью инструмента онлайн-проектирования создание схемы БД "платежная система" (юзеры, счета, транзакции)

//https://dbdiagram.io/d/paypal-659c5ec8ac844320ae7c5f31

//-----------------------------------------------------------------------------------------------------------------------

//Используя метод aggregate(), в рамках БД music вывести названия трех самых продолжительных треков

db.tracks.aggregate([
    { $sort: { duration_secs: -1 } },
    { $limit: 3 },
    { $project: { title: 1, _id: 0 } }
])

//-----------------------------------------------------------------------------------------------------------------------

//Используя метод aggregate(), в рамках БД music вывести имя одного случайного юзера не из USA

db.users.aggregate([
    { $match: { country: {$ne: "USA" }}},
     {
        $sample: { size: 1 }
    },
     {
        $project: { fullname: 1, _id: 0 }
    }
])